{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "90"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/transpose", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "512"}]}}}}}, {"name": "PartitionedCall/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "PartitionedCall/transpose_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}}}, {"name": "PartitionedCall/mul_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "PartitionedCall/transpose_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_11_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "3"}]}}}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "12"}, {"size": "90"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["input", "PartitionedCall/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Relu_1", "op": "_FusedMatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose", "PartitionedCall/mul_1"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "PartitionedCall/add_1", "op": "_FusedMatMul", "input": ["PartitionedCall/onnx_tf_prefix_Relu_1", "PartitionedCall/transpose_1", "PartitionedCall/mul_3"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Sigmoid_3", "op": "Sigmoid", "input": ["PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "_FusedMatMul", "input": ["PartitionedCall/onnx_tf_prefix_Sigmoid_3", "PartitionedCall/transpose_2", "PartitionedCall/mul_5"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/onnx_tf_prefix_Div_11", "op": "Mul", "input": ["PartitionedCall/add_2", "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_11_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Div_11"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/transpose", "shape": [90, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12966491989060944, "scale": 0.0010209836211859012, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_1", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10490549268091426, "scale": 0.0008966281425719167, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_1", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07253980052237417, "scale": 0.0005579984655567244, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_3", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05035906552391894, "scale": 0.0004094232969424304, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_2", "shape": [256, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07280244681180692, "scale": 0.0005732476126913931, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_5", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.059341151267290115, "scale": 5.4385688375024234e-05, "original_dtype": "float32"}}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_Div_11_recip", "shape": [12, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7020977735519409, "scale": 1.0, "original_dtype": "float32"}}]}]}