{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "90"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}}}, {"name": "PartitionedCall/mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/Div_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "12"}, {"size": "90"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["input", "PartitionedCall/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/model/model/model.2/Relu", "op": "_FusedMatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose", "PartitionedCall/mul_1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "PartitionedCall/add_1", "op": "_FusedMatMul", "input": ["PartitionedCall/onnx_tf_prefix_/model/model/model.2/Relu", "PartitionedCall/transpose_1", "PartitionedCall/mul_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/model/model/model.5/Sigmoid", "op": "Sigmoid", "input": ["PartitionedCall/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_2", "op": "_FusedMatMul", "input": ["PartitionedCall/onnx_tf_prefix_/model/model/model.5/Sigmoid", "PartitionedCall/transpose_2", "PartitionedCall/mul_5"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Div", "op": "Mul", "input": ["PartitionedCall/add_2", "ConstantFolding/PartitionedCall/onnx_tf_prefix_/Div_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_/Div"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/transpose", "shape": [90, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13308371159375884, "scale": 0.0010479032408957389, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_1", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11521814956384548, "scale": 0.0009367329232832965, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_1", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07123737124835744, "scale": 0.0005522276840957941, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_3", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05377252145725138, "scale": 0.0004371749711971657, "original_dtype": "float32"}}, {"name": "PartitionedCall/transpose_2", "shape": [256, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07532114246312309, "scale": 0.0005977868449454214, "original_dtype": "float32"}}, {"name": "PartitionedCall/mul_5", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0562000647187233, "scale": 3.855887289140739e-05, "original_dtype": "float32"}}, {"name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/Div_recip", "shape": [12, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7234492897987366, "scale": 1.0, "original_dtype": "float32"}}]}]}